# Rhino モジュール配置と回転パターン管理
## 概要
このプロジェクトは、Rhino でのモジュール配置と回転パターンの管理をサポートする Python スクリプトを提供します。主に、モジュールの配置と回転を効率的に処理し、重複する配置を避けるための機能を実装しています。

## 機能
- モジュールの複製と配置
- ユニークな回転パターンの生成と管理
- 重複しないモジュール配置の確認（デバッグ中）

## 使い方
- Rhinoを開く
- コマンドラインに EditPythonScript と入力し、Enterキーを押す
- Pythonスクリプトエディタが開くので、コードをコピペする

## ファイル解説
### rotate_listup_all.py
- 指定した回転角度に基づいて全ての回転パターンを生成し、グリッド状に配置します。
- コード実行後、モジュールをクリックすると処理が開始されます。
- 処理は二段階に分かれており、一段階目が終了後に再度モジュールをクリックする必要があります。
### rotate_listup_nodup_WIP.py
- 指定した回転角度に基づいて全ての回転パターンを生成し、重複を削除してグリッド状に配置する（予定）。
- 現在デバッグ中であり、うまく機能しない場合があります。というか、重複が消えません。
- コード実行後、モジュールをクリックすると処理が開始されます。
- 処理は二段階に分かれており、一段階目が終了後に再度モジュールをクリックする必要があります。
### random_rotator_line.py
- 指定した回転角度に基づいて任意の数の回転パターンをランダムに生成し、一列に配置します。重複しないようにします。
- コード実行後、モジュールをクリックすると処理が開始されます。
- 例えば、X軸、Y軸、Z軸をそれぞれ45°の倍数角度で回転させると、512通りのパターンが生成されます。その中から無作為に30個を選択できます。
### random_rotator_grid.py
- 指定した回転角度に基づいて任意の数の回転パターンをランダムに生成し、グリッド状に配置します。重複しないようにします。
- 例えば、25個のパターンを生成すると5x5のグリッドが作成されます。24個の場合も5x5の正方形に近くなるように調整されます。
- コード実行後、モジュールをクリックすると処理が開始されます。
- 例えば、X軸、Y軸、Z軸をそれぞれ45°の倍数角度で回転させると、512通りのパターンが生成されます。その中から無作為に30個を選択できます。
